package com.mjubus.server.enums;

public enum Station {
    명지대_버스관리사무소(1),
    상공회의소(2),
    진입로_명지대역(3),
    진입로_명지대(4),
    이마트(5),
    제3공학관(6),
    명지대역(10),
    명진당(11),
    동부경찰서_중앙지구대(20),
    용인시장(21),
    중앙공영주차장(22),
    명지대_정문(23),
    제1공학관(24),
    함박관(25),
    생활관_명현관(26),
    기흥역(30),
    합정역(100),
    영등포시장(101),
    영등포역(102),
    구리_롯데백화점(110),
    노원역(111),
    인천터미널역(120),
    송내역(130),
    상록수역(140),
    안산중앙역(141),
    범계역(150),
    금정역(151),
    산본역(152),
    미금역(160),
    정자역(161),
    서현역(162),
    양재역(170),
    강남역(171),
    신논현역(172),
    논현역(173),
    용인터미널(200),
    명지대_시외버스_정류장(201);
    private final int value;
    Station(int value) {
        this.value = value;
    }

    public int getValue() {
        return value;
    }
}
